---
kind: method
id: M:Autodesk.Revit.DB.SolidOptions.Dispose
source: html/06eb0253-3ba4-e215-2b55-e1d07137b1dd.htm
---
# Autodesk.Revit.DB.SolidOptions.Dispose Method

Releases all resources used by the SolidOptions

## Syntax (C#)
```csharp
public void Dispose()
```